tap "ericm/stonks"
tap "gobuffalo/tap"
tap "gts/rs", "https://intra.mirror.rackspace.com/homebrew-rs"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "jawshooah/pyenv"
tap "martido/graph"
tap "microsoft/mssql-release"
tap "objectrocket/objectrocket", "git@github.com:objectrocket/homebrew-objectrocket.git"
tap "shihanng/gig"
tap "tlk/imagemagick-x11"
tap "wagoodman/dive"
# Library for command-line editing
brew "readline"
# General-purpose data compression with high compression ratio
brew "xz"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# Portable Foreign Function Interface library
brew "libffi"
# Core application library for C
brew "glib"
# Use AWS IAM credentials to authenticate to Kubernetes
brew "aws-iam-authenticator"
# Official Amazon AWS command-line interface
brew "awscli"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Platform built on V8 to build network applications
brew "node"
# Secure and free password manager for all of your devices
brew "bitwarden-cli"
# Fish completion for brew-cask
brew "brew-cask-completion"
# New way to see and navigate directory trees
brew "broot"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Open source suite of directory software
brew "openldap"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Completion script for docker-compose
brew "docker-compose-completion"
# Tool for managing dock items
brew "dockutil"
# Simple command-line tool for creating clusters on Amazon EKS
brew "eksctl"
# Modern replacement for 'ls'
brew "exa"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Low-level cryptographic library
brew "nettle"
# Validating, recursive, caching DNS resolver
brew "unbound"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# TIFF library and utilities
brew "libtiff"
# Secure Reliable Transport
brew "srt"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Small git utilities
brew "git-extras"
# Emoji guide for your commit messages
brew "gitmoji"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Stricter gofmt
brew "gofumpt"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Kubernetes package manager
brew "helm"
# Kubernetes package manager
brew "helm@2"
# Command-line utility for Home Assistant
brew "homeassistant-cli"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Configurable static site generator
brew "hugo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Lazier way to manage everything docker
brew "lazydocker"
# Postgres C API library
brew "libpq"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# XML security library
brew "libxmlsec1"
# Scalable distributed version control system
brew "mercurial"
# Automated testing for Ansible roles
brew "molecule"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Remote terminal application
brew "mosh"
# Fast website link checker in Go
brew "muffet"
# Tail multiple files in one terminal simultaneously
brew "multitail"
# NCurses Disk Usage
brew "ncdu"
# Small build system for use with gyp or CMake
brew "ninja"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk"
# Swiss-army knife of markup format conversion
brew "pandoc"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Tool for managing OCI containers and pods
brew "podman"
# Python package management tool
brew "poetry"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Python version management
brew "pyenv"
# Make Python build faster, using the leverage of `ccache`
brew "pyenv-ccache"
# Migrate pip packages from one Python version to another
brew "pyenv-pip-migrate"
# Emulator for x86 and PowerPC
brew "qemu"
# QR Code generation
brew "qrencode"
# CLI for Rackspace
brew "rack"
# Rsync for cloud storage
brew "rclone"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Tools for file renaming
brew "renameutils"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Safe, concurrent, practical language
brew "rust"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Tool for building source and injecting into docker images
brew "source-to-image"
# Proxy server that works as a poor man's VPN
brew "sshuttle"
# Cross-shell prompt for astronauts
brew "starship"
# Tokencode generator compatible with RSA SecurID 128-bit (AES)
brew "stoken"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Tool to build, change, and version infrastructure
brew "terraform"
# Program that allows you to count code, quickly
brew "tokei"
# Generic Python virtualenv management and test command-line tool
brew "tox"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# ODBC 3 connectivity for UNIX
brew "unixodbc"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Execute commands when watched files change
brew "watchexec"
# Internet file retriever
brew "wget"
# Homebrew, but with Docker images
brew "whalebrew"
# Yet Another Dotfiles Manager
brew "yadm"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Process YAML documents from the CLI
brew "yq"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
brew "ericm/stonks/stonks"
brew "gobuffalo/tap/buffalo"
# Browser plugin for Magic Button and One Click Login
brew "gts/rs/grandcentral"
# Command-line utility for interacting with Rackspace systems
brew "gts/rs/hammertime"
# URL handler to launch iTerm from raxlogin:// links
brew "gts/rs/raxlogin"
# Scripted RDP access to Windows servers
brew "gts/rs/rdpwin"
brew "jawshooah/pyenv/pyenv-default-packages"
# ODBC Driver for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/msodbcsql17"
# Sqlcmd and Bcp for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/mssql-tools"
# Allows you to interact with the infra-api
brew "objectrocket/objectrocket/infraclient"
# gitignore file generator
brew "shihanng/gig/gig"
# Tools and libraries to manipulate images in many formats (X11 support)
brew "tlk/imagemagick-x11/imagemagick"
# A tool for exploring each layer in a docker image
brew "wagoodman/dive/dive"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# JDK from the Java User Group (JUG)
cask "adoptopenjdk"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Desktop client for Android Messages
cask "android-messages"
# Tools for building Android applications
cask "android-studio"
# Software-defined perimeter for secure network access
cask "appgate-sdp-client"
# Data management tool that enables working with SQL Server
cask "azure-data-studio"
cask "balance-lock"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Desktop password and login vault
cask "bitwarden"
# Tool to show live information about the batteries in various devices
cask "coconutbattery"
cask "day-o"
# Free universal database tool and SQL client
cask "dbeaver-community"
cask "digikam"
# Voice and text chat software
cask "discord"
# Disk usage utility
cask "disk-inventory-x"
# App to build and share containerized applications and microservices
cask "docker"
# Tool to hide status bar icons
cask "dozer"
# Finds duplicate files in a computer system
cask "dupeguru"
# Web browser
cask "firefox"
# Web browser
cask "firefox-developer-edition"
cask "font-fantasque-sans-mono"
cask "font-fantasquesansmono-nerd-font"
cask "font-firacode-nerd-font"
cask "font-hack-nerd-font"
cask "font-ia-writer-mono"
# Mind-mapping software written in Java
cask "freemind"
# Git client focusing on productivity
cask "gitkraken"
cask "google-backup-and-sync"
# Web browser
cask "google-chrome"
# Genealogy software
cask "gramps"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Free and open-source media player
cask "iina"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2-beta"
cask "java"
# Visual diff and merge tool
cask "meld"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge"
cask "microsoft-teams"
# Silence embarrassing notifications while screensharing
cask "muzzle"
# Database administration and development tool
cask "navicat-for-mysql"
# Finds large, unwanted files and deletes them
cask "omnidisksweeper"
# Cloud storage client
cask "onedrive"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# MongoDB management tool
cask "robo-3t"
cask "securid"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
# Instant messaging application focusing on security
cask "signal-beta"
# Interior design application
cask "sweet-home3d"
# Unpacks archive files
cask "the-unarchiver"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Development environment
cask "vagrant"
# Free and open-source hosted hypervisor for x86 virtualization
cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
cask "wkhtmltopdf"
# Cross platform gRPC client
cask "wombat"
# Open-source version of the X.Org X Window System
cask "xquartz"
# Application for configuring any YubiKey
cask "yubico-yubikey-manager"
# Multi-platform graphical interface for official Nmap Security Scanner
cask "zenmap"
# Video communication and virtual meeting platform
cask "zoom"
# Outlook Plugin for Zoom.us
cask "zoom-outlook-plugin"
