tap "ericm/stonks"
tap "gobuffalo/tap"
tap "gts/rs", "https://intra.mirror.rackspace.com/homebrew-rs"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/core"
tap "homebrew/services"
tap "jawshooah/pyenv"
tap "microsoft/mssql-release"
tap "objectrocket/objectrocket", "git@github.com:objectrocket/homebrew-objectrocket.git"
tap "shihanng/gig"
tap "tlk/imagemagick-x11"
tap "wagoodman/dive"
brew "readline" # Library for command-line editing
brew "sqlite" # Command-line interface for SQLite
brew "xz" # General-purpose data compression with high compression ratio
brew "ansible" # Automate deployment, configuration, and upgrading
brew "ansible-lint" # Checks ansible playbooks for practices and behaviour
brew "libffi" # Portable Foreign Function Interface library
brew "glib" # Core application library for C
brew "aws-iam-authenticator" # Use AWS IAM credentials to authenticate to Kubernetes
brew "awscli" # Official Amazon AWS command-line interface
brew "bash-completion" # Programmable completion for Bash 3.2
brew "bat" # Clone of cat(1) with syntax highlighting and Git integration
brew "node" # Platform built on V8 to build network applications
brew "bitwarden-cli" # Secure and free password manager for all of your devices
brew "brew-cask-completion" # Fish completion for brew-cask
brew "broot" # New way to see and navigate directory trees
brew "caddy" # Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "circleci" # Enables you to reproduce the CircleCI environment locally
brew "cmake" # Cross-platform make
brew "coreutils" # GNU File, Shell, and Text utilities
brew "openldap" # Open source suite of directory software
brew "curl" # Get a file from an HTTP, HTTPS or FTP server
brew "docker-compose-completion" # Completion script for docker-compose
brew "eksctl" # Simple command-line tool for creating clusters on Amazon EKS
brew "exa" # Modern replacement for 'ls'
brew "exiftool" # Perl lib for reading and writing EXIF metadata
brew "fd" # Simple, fast and user-friendly alternative to find
brew "nettle" # Low-level cryptographic library
brew "unbound" # Validating, recursive, caching DNS resolver
brew "gobject-introspection" # Generate introspection data for GObject libraries
brew "libtiff" # TIFF library and utilities
brew "srt" # Secure Reliable Transport
brew "ffmpeg" # Play, record, convert, and stream audio and video
brew "findutils" # Collection of GNU find, xargs, and locate
brew "gh" # GitHub command-line tool
brew "ghostscript" # Interpreter for PostScript and PDF
brew "git" # Distributed revision control system
brew "git-extras" # Small git utilities
brew "go" # Open source programming language to build simple/reliable/efficient software
brew "gnu-sed" # GNU implementation of the famous stream editor
brew "gnupg" # GNU Pretty Good Privacy (PGP) package
brew "gofumpt" # Stricter gofmt
brew "graphviz" # Graph visualization software from AT&T and Bell Labs
brew "gtk+3" # Toolkit for creating graphical user interfaces
brew "helm" # Kubernetes package manager
brew "helm@2" # Kubernetes package manager
brew "homeassistant-cli" # Command-line utility for Home Assistant
brew "httpie" # User-friendly cURL replacement (command-line HTTP client)
brew "hugo" # Configurable static site generator
brew "jq" # Lightweight and flexible command-line JSON processor
brew "kubectx" # Tool that can switch between kubectl contexts easily and create aliases
brew "lazydocker" # Lazier way to manage everything docker
brew "libpq" # Postgres C API library
brew "libssh" # C library SSHv1/SSHv2 client and server protocols
brew "libxmlsec1" # XML security library
brew "mercurial" # Scalable distributed version control system
brew "molecule" # Automated testing for Ansible roles
brew "moreutils" # Collection of tools that nobody wrote when UNIX was young
brew "mosh" # Remote terminal application
brew "muffet" # Fast website link checker in Go
brew "multitail" # Tail multiple files in one terminal simultaneously
brew "ncdu" # NCurses Disk Usage
brew "ninja" # Small build system for use with gyp or CMake
brew "nmap" # Port scanning utility for large networks
brew "node@8" # Platform built on V8 to build network applications
brew "nvm" # Manage multiple Node.js versions
brew "openjdk" # Development kit for the Java programming language
brew "pandoc" # Swiss-army knife of markup format conversion
brew "pgcli" # CLI for Postgres with auto-completion and syntax highlighting
brew "pipx" # Execute binaries from Python packages in isolated environments
brew "podman" # Tool for managing OCI containers and pods
brew "poetry" # Python package management tool
brew "pre-commit" # Framework for managing multi-language pre-commit hooks
brew "pyenv" # Python version management
brew "pyenv-ccache" # Make Python build faster, using the leverage of `ccache`
brew "pyenv-pip-migrate" # Migrate pip packages from one Python version to another
brew "qemu" # Emulator for x86 and PowerPC
brew "qrencode" # QR Code generation
brew "rack" # CLI for Rackspace
brew "rclone" # Rsync for cloud storage
brew "rename" # Perl-powered file rename script with many helpful built-ins
brew "renameutils" # Tools for file renaming
brew "ripgrep" # Search tool like grep and The Silver Searcher
brew "ruby" # Powerful, clean, object-oriented scripting language
brew "rust" # Safe, concurrent, practical language
brew "shellcheck" # Static analysis and lint tool, for (ba)sh scripts
brew "sl" # Prints a steam locomotive if you type sl instead of ls
brew "source-to-image" # Tool for building source and injecting into docker images
brew "sshuttle" # Proxy server that works as a poor man's VPN
brew "starship" # Cross-shell prompt for astronauts
brew "stoken" # Tokencode generator compatible with RSA SecurID 128-bit (AES)
brew "tealdeer" # Very fast implementation of tldr in Rust
brew "terraform" # Tool to build, change, and version infrastructure
brew "tokei" # Program that allows you to count code, quickly
brew "tox" # Generic Python virtualenv management and test command-line tool
brew "tree" # Display directories as trees (with optional color/HTML output)
brew "unixodbc" # ODBC 3 connectivity for UNIX
brew "watch" # Executes a program periodically, showing output fullscreen
brew "watchexec" # Execute commands when watched files change
brew "wget" # Internet file retriever
brew "whalebrew" # Homebrew, but with Docker images
brew "yadm" # Yet Another Dotfiles Manager
brew "yarn" # JavaScript package manager
brew "youtube-dl" # Download YouTube videos from the command-line
brew "yq" # Process YAML documents from the CLI
brew "zlib" # General-purpose lossless data-compression library
brew "zsh" # UNIX shell (command interpreter)
brew "ericm/stonks/stonks"
brew "gobuffalo/tap/buffalo"
brew "gts/rs/grandcentral" # Browser plugin for Magic Button and One Click Login
brew "gts/rs/hammertime" # Command-line utility for interacting with Rackspace systems
brew "gts/rs/raxlogin" # URL handler to launch iTerm from raxlogin:// links
brew "gts/rs/rdpwin" # Scripted RDP access to Windows servers
brew "jawshooah/pyenv/pyenv-default-packages"
brew "microsoft/mssql-release/msodbcsql17" # ODBC Driver for Microsoft(R) SQL Server(R)
brew "microsoft/mssql-release/mssql-tools" # Sqlcmd and Bcp for Microsoft(R) SQL Server(R)
brew "objectrocket/objectrocket/infraclient" # Allows you to interact with the infra-api
brew "shihanng/gig/gig" # gitignore file generator
brew "tlk/imagemagick-x11/imagemagick" # Tools and libraries to manipulate images in many formats (X11 support)
brew "wagoodman/dive/dive" # A tool for exploring each layer in a docker image
cask "android-messages" # Desktop client for Android Messages
cask "android-studio" # Tools for building Android applications
cask "appgate-sdp-client" # Software-defined perimeter for secure network access
cask "balance-lock" # Keep your Mac audio centred
cask "balenaetcher" # Tool to flash OS images to SD cards & USB drives
cask "day-o" # A simple menu bar clock replacement
cask "dbeaver-community" # Free universal database tool and SQL client
cask "discord" # Voice and text chat software
cask "disk-inventory-x" # Disk usage utility
cask "docker" # App to build and share containerized applications and microservices
cask "dozer" # Tool to hide status bar icons
cask "dupeguru" # Finds duplicate files in a computer system
cask "firefox" # Web browser
cask "firefox-developer-edition" # Web browser
cask "font-fantasque-sans-mono"
cask "font-fantasquesansmono-nerd-font"
cask "font-firacode-nerd-font"
cask "font-hack-nerd-font"
cask "font-ia-writer-mono"
cask "freemind" # Mind-mapping software written in Java
cask "gitkraken" # Git client focusing on productivity
cask "google-backup-and-sync"
cask "google-chrome" # Web browser
cask "gramps" # Genealogy software
cask "grandperspective" # Graphically shows disk usage within a file system
cask "iina" # Free and open-source media player
cask "insomnia" # HTTP and GraphQL Client
cask "iterm2-beta" # Terminal emulator as alternative to Apple's Terminal app
cask "meld" # Visual diff and merge tool
cask "muzzle" # Silence embarrassing notifications while screensharing
cask "omnidisksweeper" # Finds large, unwanted files and deletes them
cask "onedrive" # Cloud storage client
cask "rectangle" # Move and resize windows using keyboard shortcuts or snap areas
cask "robo-3t" # MongoDB management tool
cask "session-manager-plugin" # Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "signal-beta" # Instant messaging application focusing on security
cask "the-unarchiver" # Unpacks archive files
cask "tunnelblick" # Free and open-source OpenVPN client
cask "vagrant" # Development environment
cask "virtualbox" # Free and open-source hosted hypervisor for x86 virtualization
cask "visual-studio-code" # Open-source code editor
cask "vlc" # Multimedia player
cask "wkhtmltopdf"
cask "xquartz" # Open-source version of the X.Org X Window System
cask "yubico-yubikey-manager" # Cross-platform application for configuring any YubiKey over all USB interfaces
cask "zenmap" # Multi-platform graphical interface for official Nmap Security Scanner
cask "zoom" # Video communication and virtual meeting platform
cask "zoom-outlook-plugin" # Outlook Plugin for Zoom.us
